package com.newhope.moneyfeed.api.enums;

/**
 * 短信模板枚举类
 *
 * @author: zhangyanyan
 * @date: 2018/6/8
 */
public enum SmsTemplateEnums {
	SMS_151772058("用户登录商城，发送手机验证码", "SMS_151772058"),
	SMS_152205419("用户修改支付密码，发送手机验证码", "SMS_152205419"),
	SMS_151772088("客户管理系统用户修改密码，发送手机验证码", "SMS_151772088"),
    SMS_151767097("修改拉料司机信息，发送手机短信","SMS_151767097"),
    SMS_152210313("用户修改支付密码成功，发送手机短信","SMS_152210313"),
    SMS_151772067("录入出厂磅单","SMS_151772067"),
    SMS_151767105("银行卡支付成功","SMS_151767105"),
    SMS_151772074("可用余额变动-消费","SMS_151772074"),
    SMS_151767106("可用余额变动-充值","SMS_151767106"),
    SMS_151772077("每天7点查询订单锁库存失败-内勤","SMS_151772077"),
    SMS_151767107("当日已支付订单锁库存失败-内勤","SMS_151767107"),
    SMS_151767108("当日已支付订单锁库存失败-用户","SMS_151767108"),
    SMS_151772083("商户主动关闭订单","SMS_151772083"),
    SMS_151767090("订单未支付，距离支付时间还剩1小时","SMS_151767090"),
    SMS_151767094("关闭超时未支付订单","SMS_151767094"),
    SMS_151772902("订单-需人工核价","SMS_151772902"),
    SMS_151767110("订单退款成功（EBS订单状态为已取消）","SMS_151767110"),
    SMS_151772080("线下核价-完成人工核价","SMS_151772080"),
    SMS_151767099("修改拉料时间","SMS_151767099"),
    SMS_151767096("支付成功","SMS_151767099"),
    SMS_154586847("当日订单支付成功但锁库存失败-商户后台配置","SMS_154586847"),
    SMS_154592019("当日订单支付成功但锁库存失败-用户","SMS_154592019"),
    SMS_152205437("可用余额变动-充值","SMS_152205437"),
    SMS_152210484("代用户下单","SMS_152210484"),
    SMS_154592101("商户端修改个人信息","SMS_154592101"),
    SMS_154587033("商户端新增员工","SMS_154587033"),
    SMS_154592204("平台端修改登陆密码","SMS_154592204"),
    SMS_154592207("平台端修改个人信息","SMS_154592207"),
    SMS_154592045("用户进入【我的-个人信息】，修改手机号码","SMS_154592045"),
    SMS_154592060("被邀请人点击邀请人发送的邀请链接，输入手机号+验证码确认邀请信息","SMS_154592060"),
    SMS_154586889("进入【我的-员工列表-编辑】，修改员工手机号","SMS_154586889")
    ;

    private String desc;

    private String templateId;

    private SmsTemplateEnums(String desc, String templateId) {
        this.desc = desc;
        this.templateId = templateId;
    }

    public String getTemplateId() {
        return templateId;
    }

    public void setTemplateId(String templateId) {
        this.templateId = templateId;
    }

    public String getDesc() {
        return desc;
    }

    public void setDesc(String desc) {
        this.desc = desc;
    }

}
